#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/**
 * 7-1 编写一个程序，根据它自身被调用时存放在argv[0]中的名字，实现将大写字母转换为小写字母或将小写字母转换为大写字母的功能
 */
#if 0
int main()
{
    return 0;
}
#endif
/**
 * 7-2 编写一个程序，以合理的方式打印任何输入，该程序至少能根据用户的习惯以八进制或十六进制打印非图形字符，并截断长文本行
 */
#if 0
int main()
{
    return 0;
}
#endif

/**
 * 7-3 改写minprintf函数，使它能完成printf函数的更多功能
 */
#if 0
int main()
{
    return 0;
}
#endif

/**
 * 7-4 类似于上一节中的函数minprintf,编写scanf函数的一个简化版本
 */
#if 0

#endif

/**
 * 7-5 改写第四章后缀计算器程序，用scanf函数和sscanf函数是ixan输入以及数的转换
 */
#if 0
int main()
{
    exit(0);
}
#endif

/**
 * 7-6 编写一个程序，比较两个文件并打印它们第一个不相同的行
 */
#if 0
#endif

/**
 * 7-7 修改第五章的模式查找程序，使它从一个命名文件的集合中读取输入(有文件名参数时)，如果没有文件名参数，则从标准输入中读取输入，当发现一个匹配行时，
 * 是否应该将相应的文件名打印出来？
 */
#if 0
#endif

/**
 * 7-8 编写一个程序，以打印一个文件集合，每个文件从新的一页开始打印，并且打印每个文件相应的标题和页数
 */
#if 0
int main()
{
    system("date");
    exit(0);
}
#endif

/**
 * 7-9  类似于isupper这样的函数可以通过某种方式实现以达到节省空间或时间的目的，考虑节省空间或时间的实现方式
 */

